Autodesk.Revit.DB.Structure.RebarConstraintType.ToCustomTarget
Handle is constrained to a custom target which is identified by the Autodesk::Revit::DB::Structure::IRebarUpdateServer
which is defining the handle.

Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdgeCover
Handle is constrained to a host Element edge, where the constraint position is calculated at the intersection of the two adjacent faces, each offset inward by their cover distances.

Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdge
Handle is constrained to a host Element edge.